<a href="https://colab.research.google.com/github/XingxinHE/Python-for-Data-Analysis-Notes/blob/master/8_3_Reshaping_and_Pivoting.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

## Reshaping with Hierarchical Indexing

.stack()

.unstack()

In [2]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
          index=pd.Index(['Ohio', 'Colorado'], name='state'),
          columns=pd.Index(['one', 'two', 'three'],
          name='number'))

data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [4]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [5]:
result.unstack() #ÈªòËÆ§unstackÁöÑlevelÊòØ-1Ôºå‰πüÂ∞±ÊòØÊúÄÈáåÈù¢ÁöÑÈÇ£‰∏ÄÂ±Ç

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [7]:
result.unstack(level=0) #ÂèØ‰ª•specifyÊòØË°®Â±Ç

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [8]:
result.unstack('state') #‰πüÂèØ‰ª•specifyÂ±ÇÁöÑÂêçÂ≠óÔºåunstack‰ªÄ‰πàÔºå‰ªÄ‰πàÂ∞±ÊòØcolumns

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

unstackÂèØËÉΩ‰ºö‰∫ßÁîüÂá∫NaNÔºå‰ΩÜÊòØstackÁöÑÈªòËÆ§ËÆæÁΩÆÊòØÂøΩÁï•NaN

In [9]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
data2 = pd.concat([s1, s2], keys=['one', 'two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [11]:
data2.unstack() #ÂèØ‰ª•ÁúãÂà∞ÊúâÂá†‰∏™NaN

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [12]:
data2.unstack().stack() #ÈªòËÆ§ÊòØÊ∏ÖÈô§NaNÁöÑ

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [13]:
data2.unstack().stack(dropna=False) #ÂèØ‰ª•specify‰∏çË¶Ådrop na

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

ÂΩì‰Ω†unstackÊüê‰∏ÄLevelÂèòÊàêcolumnsÔºå‰∏äÈù¢ÊèêÂà∞‰∫ÜËøôÂè•ËØùÔºå‰ΩÜÊòØËøòË¶ÅÂä†‰∏ÄÂè•ÔºåÂèòÊàêcolumns‰πãÂêéÊòØÂèòÊàêÊúÄ‰ΩéÁ∫ßÁöÑcolumnsÔºå‰πüÂ∞±ÊòØbottomÁöÑcolumns

In [14]:
df = pd.DataFrame({'left': result, 'right': result + 5},
          columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [15]:
df.unstack('state')
#ÂèØ‰ª•ËßÇÂØüÂà∞stateË¢´ÊãÜÂºÄ‰∫ÜÔºå
#ËÄå‰∏î‰Ωç‰∫écolumn‰∏ãÈù¢ÁöÑ‰ΩçÁΩÆ

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [16]:
df.unstack('state').stack('side') #ÂèØ‰ª•specifystackÂì™‰∏ÄÂ±Ç

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

In [17]:
df.unstack('state').stack('state')

side             left  right
number state
one    Ohio         0      5
       Colorado     3      8
two    Ohio         1      6
       Colorado     4      9
three  Ohio         2      7
       Colorado     5     10

## Pivoting "Long" to "Wide" Format

Â§ö‰∏™Êó∂Èó¥Â∫èÂàóÊï∞ÊçÆÈÄöÂ∏∏ÊòØ‰ª•ÊâÄË∞ìÁöÑ‚ÄúÈïøÊ†ºÂºè‚ÄùÔºàlongÔºâÊàñ‚ÄúÂ†ÜÂè†Ê†ºÂºè‚ÄùÔºàstackedÔºâÂ≠òÂÇ®Âú®Êï∞ÊçÆÂ∫ìÂíåCSV‰∏≠ÁöÑ

üåü‚ÄúÈïø‚ÄùÊòØÊåáÂæÄ‰∏ãÔºårowË∂äÊù•Ë∂äÂ§ö

üåü‚ÄúÂÆΩ‚ÄùÊòØÊåáÂæÄÂè≥ÔºåcolumnsË∂äÊù•Ë∂äÂ§ö

In [21]:
url = 'https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/examples/macrodata.csv'
data = pd.read_csv(url)
data.head()

     year  quarter   realgdp  realcons  ...  unemp      pop  infl  realint
0  1959.0      1.0  2710.349    1707.4  ...    5.8  177.146  0.00     0.00
1  1959.0      2.0  2778.801    1733.7  ...    5.1  177.830  2.34     0.74
2  1959.0      3.0  2775.488    1751.8  ...    5.3  178.657  2.74     1.09
3  1959.0      4.0  2785.204    1753.7  ...    5.6  179.386  0.27     4.06
4  1960.0      1.0  2847.699    1770.5  ...    5.2  180.007  2.31     1.19

[5 rows x 14 columns]

In [22]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter, name='date')
periods

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203, freq='Q-DEC')

In [23]:
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')
columns

Index(['realgdp', 'infl', 'unemp'], dtype='object', name='item')

In [24]:
data = data.reindex(columns=columns) #reindexËøô‰∏™Âæà6ÔºåËÉΩÊääÊÉ≥Ë¶ÅÁöÑË¶Å‰∫ÜÔºåÂÖ∂ÂÆÉ‰∏çË¶Å
data.head()

item   realgdp  infl  unemp
0     2710.349  0.00    5.8
1     2778.801  2.34    5.1
2     2775.488  2.74    5.3
3     2785.204  0.27    5.6
4     2847.699  2.31    5.2

In [25]:
#Â§ÑÁêÜÂ•Ωcolumns‰πãÂêéÔºåÂÜçÂ§ÑÁêÜindexÔºàrowÔºâ
data.index = periods.to_timestamp('D', 'end')

In [26]:
data.head()

item                            realgdp  infl  unemp
date
1959-03-31 23:59:59.999999999  2710.349  0.00    5.8
1959-06-30 23:59:59.999999999  2778.801  2.34    5.1
1959-09-30 23:59:59.999999999  2775.488  2.74    5.3
1959-12-31 23:59:59.999999999  2785.204  0.27    5.6
1960-03-31 23:59:59.999999999  2847.699  2.31    5.2

In [27]:
ldata = data.stack()
ldata.head()

date                           item
1959-03-31 23:59:59.999999999  realgdp    2710.349
                               infl          0.000
                               unemp         5.800
1959-06-30 23:59:59.999999999  realgdp    2778.801
                               infl          2.340
dtype: float64

In [28]:
ldata = ldata.reset_index()
ldata.head()

                           date     item         0
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340

In [29]:
ldata = ldata.rename(columns={0:'value'})
ldata.head()

                           date     item     value
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340

ËøôÁßçÊ†ºÂºèÊòØMySQLÁöÑÁªèÂÖ∏Ê†ºÂºèÔºåÂú®‰∫é‰∏§‰∏™ÂÖ≥ÈîÆ‰ø°ÊÅØÔºådateÂíåitemÊòØÂÖ≥ÈîÆ‰ø°ÊÅØÔºåÂè™Ë¶ÅÊúâËøô‰∏§‰∏™‰ø°ÊÅØÔºåvalueËá™ÁÑ∂ËÄåÁÑ∂Â∞±ÂèØ‰ª•ÂæóÂá∫„ÄÇ

ÈÇ£‰πàÂ¶ÇÊûú‰Ω†‰π†ÊÉØdataframeÊ†ºÂºèÁöÑËØùÔºåÂ∞±ÂèØ‰ª•Áî®pivotÊù•ÂÆûÁé∞

In [31]:
pivoted = ldata.pivot('date', 'item', 'value') #ÊääÂÆÉ‰ªélong formatÂèòÊàêwide format
pivoted

item                           infl    realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00   2710.349    5.8
1959-06-30 23:59:59.999999999  2.34   2778.801    5.1
1959-09-30 23:59:59.999999999  2.74   2775.488    5.3
1959-12-31 23:59:59.999999999  0.27   2785.204    5.6
1960-03-31 23:59:59.999999999  2.31   2847.699    5.2
...                             ...        ...    ...
2008-09-30 23:59:59.999999999 -3.16  13324.600    6.0
2008-12-31 23:59:59.999999999 -8.79  13141.920    6.9
2009-03-31 23:59:59.999999999  0.94  12925.410    8.1
2009-06-30 23:59:59.999999999  3.37  12901.504    9.2
2009-09-30 23:59:59.999999999  3.56  12990.341    9.6

[203 rows x 3 columns]

‰∏äÈù¢Âè™Êúâ‰∏Ä‰∏™valueÔºåÈÇ£ÂÅáÂ¶ÇÊúâ‰∏§‰∏™valueÂë¢Ôºü

In [33]:
ldata['value2'] = np.random.randn(len(ldata))
ldata.head()

                           date     item     value    value2
0 1959-03-31 23:59:59.999999999  realgdp  2710.349 -1.188260
1 1959-03-31 23:59:59.999999999     infl     0.000 -0.142315
2 1959-03-31 23:59:59.999999999    unemp     5.800  0.335999
3 1959-06-30 23:59:59.999999999  realgdp  2778.801  1.924186
4 1959-06-30 23:59:59.999999999     infl     2.340 -0.118000

In [35]:
pivoted = ldata.pivot('date', 'item')
pivoted
#ÈÇ£‰πàÊãÜÂá∫Êù•ÁöÑÂÄºÂ∞±‰ºöÂèòÊàêhierarchical ‰∫Ü

                              value             ...    value2
item                           infl    realgdp  ...   realgdp     unemp
date                                            ...
1959-03-31 23:59:59.999999999  0.00   2710.349  ... -1.188260  0.335999
1959-06-30 23:59:59.999999999  2.34   2778.801  ...  1.924186 -0.220719
1959-09-30 23:59:59.999999999  2.74   2775.488  ...  0.506217  3.351093
1959-12-31 23:59:59.999999999  0.27   2785.204  ... -0.853514  0.383990
1960-03-31 23:59:59.999999999  2.31   2847.699  ...  0.383475  0.960597
...                             ...        ...  ...       ...       ...
2008-09-30 23:59:59.999999999 -3.16  13324.600  ... -2.590649 -1.297989
2008-12-31 23:59:59.999999999 -8.79  13141.920  ... -0.716232  2.218971
2009-03-31 23:59:59.999999999  0.94  12925.410  ... -0.699466 -0.833255
2009-06-30 23:59:59.999999999  3.37  12901.504  ...  0.142441  0.980879
2009-09-30 23:59:59.999999999  3.56  12990.341  ...  1.055907 -0.883785

[203 rows x 6 columns]

In [36]:
pivoted['value'][:5] #Áî®ËøôÁßçÊñπÊ≥ïÂèØ‰ª•Âè™ÈÄâÂÖ∂‰∏≠‰∏Ä‰∏™value

item                           infl   realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00  2710.349    5.8
1959-06-30 23:59:59.999999999  2.34  2778.801    5.1
1959-09-30 23:59:59.999999999  2.74  2775.488    5.3
1959-12-31 23:59:59.999999999  0.27  2785.204    5.6
1960-03-31 23:59:59.999999999  2.31  2847.699    5.2

pivotÁ≠âÊïà‰∫éÂï•Ôºüpivot = set_index+unstack

In [37]:
unstacked = ldata.set_index(['date', 'item'])
unstacked.head()

                                          value    value2
date                          item
1959-03-31 23:59:59.999999999 realgdp  2710.349 -1.188260
                              infl        0.000 -0.142315
                              unemp       5.800  0.335999
1959-06-30 23:59:59.999999999 realgdp  2778.801  1.924186
                              infl        2.340 -0.118000

In [38]:
unstacked = unstacked.unstack('item')
unstacked.head()

                              value            ...    value2
item                           infl   realgdp  ...   realgdp     unemp
date                                           ...
1959-03-31 23:59:59.999999999  0.00  2710.349  ... -1.188260  0.335999
1959-06-30 23:59:59.999999999  2.34  2778.801  ...  1.924186 -0.220719
1959-09-30 23:59:59.999999999  2.74  2775.488  ...  0.506217  3.351093
1959-12-31 23:59:59.999999999  0.27  2785.204  ... -0.853514  0.383990
1960-03-31 23:59:59.999999999  2.31  2847.699  ...  0.383475  0.960597

[5 rows x 6 columns]